# **`PANDAS - ASSIGNEMNT`**

In [1]:
import pandas as pd

`Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.`

In [4]:
#Ans1.
s = pd.Series([2,8,15,16,23,42])
print(type(s))
print(s)

<class 'pandas.core.series.Series'>
0     2
1     8
2    15
3    16
4    23
5    42
dtype: int64

`Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the`
`variable print it.`

In [10]:
#Ans2.
l = ["tj",(1,2,3),{'age':34},{45,32,32,}, 12,1,2, 34+5j,[1,2,3],"j"]
s = pd.Series(l)
print(len(s))
print(s)

10
0             tj
1      (1, 2, 3)
2    {'age': 34}
3       {32, 45}
4             12
5              1
6              2
7        (34+5j)
8      [1, 2, 3]
9              j
dtype: object

`Q3. Create a Pandas DataFrame that contains the following data:`
`Then, print the DataFrame.`

In [13]:
#Ans3
df = pd.DataFrame({"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

`Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.`

Series is a type of list in pandas which can take integer values, string values, double values and more. But in Pandas Series we return an object in the form of list, having index starting from 0 to n, Where n is the length of values in series.Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.It is composed of multiple series and very versatile in tabular data manipulation

In [19]:
#Series is one dimensional
s[:5] # it can be sliced based on index

0             tj
1      (1, 2, 3)
2    {'age': 34}
3       {32, 45}
4             12
dtype: object

In [24]:
#dataframe is more than one dimension
df.shape

(3, 3)

`Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can`
`you give an example of when you might use one of these functions?`

`1. read_csv()`

This is one of the most crucial pandas methods in Python. read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame. All you need to do is mention the path of the file you want it to read. It can also read files separated by delimiters other than comma, like | or tab. More details here.

- to_csv() function works exactly opposite of read_csv(). It helps to write data contained in a Pandas DataFrame or Series to a csv file.

In [6]:
import pandas as pd
df = pd.read_csv("D:/pwskills-Data_Science_Masters/titanic_data.csv")
df
#df.to_csv("titanic_work_data.csv") # this will create the titanic_work_data.csv file using the data from df.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

`2. head()`

head(n) is used to return the first n rows of a dataset. By default, df.head() will return the first 5 rows of the DataFrame. If you want more/less number of rows, you can specify n as an integer.

In [7]:
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

`3. describe()`

describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series. It summarizes central tendency and dispersion of the dataset. describe() helps in getting a quick overview of the dataset

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

`4. memory_usage()`

memory_usage() returns a Pandas Series having the memory usage of each column (in bytes) in a Pandas DataFrame. By specifying the deep attribute as True, we can get to know the actual space being taken by each column

In [9]:
df.memory_usage()

Index           128
PassengerId    7128
Survived       7128
Pclass         7128
Name           7128
Sex            7128
Age            7128
SibSp          7128
Parch          7128
Ticket         7128
Fare           7128
Cabin          7128
Embarked       7128
dtype: int64

`5. dtypes`

Returns the datatypes of each column in a dataframe

In [10]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

`6. shape` 

Retruns the number of rows and columns in the dataframe

In [11]:
df.shape

(891, 12)

`7. astype()`

astype() is used to cast a Python object to a particular data type. It can be a very helpful function in case your data is not stored in the correct format (data type). For instance, if floating point numbers have somehow been misinterpreted by Python as strings, you can convert them back to floating point numbers with astype(). Or if you want to convert an object datatype to category, you can use astype().

In [22]:
df.Name.astype(str)

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

`8. loc[:]`

loc[:] helps to access a group of rows and columns in a dataset, a slice of the dataset, as per our requirement. We can also access rows and columns based on labels instead of row and column number.

In [42]:
df.loc[0:4,["Age","Survived"]]

    Age  Survived
0  22.0         0
1  38.0         1
2  26.0         1
3  35.0         1
4  35.0         0

`9. value_counts()`

value_counts() returns a Pandas Series containing the counts of unique values.

In [43]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

`10. groupby()`

groupby() is used to group a Pandas DataFrame by 1 or more columns, and perform some mathematical operation on it. groupby() can be used to summarize data in a simple manner.

In [50]:
df.groupby("Sex")["Age"].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

`Q6. Which of the following is mutable in nature Series, DataFrame, Panel?`

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

`Q7. Create a DataFrame using multiple Series. Explain with an example.`

In [53]:
#Creating a set of 3 pandas series
series1 = pd.Series(["tj","praveen","madan"])
series2 = pd.Series(["naidu","raju","raj"])
series3 = pd.Series([36,35,34])
print(type(series1))
print(type(series2))
print(type(series3))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [55]:
#creating a dataframe from multiple series
df = pd.DataFrame({"firstname":series1,"lastname":series2,"age":series3})
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

  firstname lastname  age
0        tj    naidu   36
1   praveen     raju   35
2     madan      raj   34